app/controllers/comments_controller.rb

SELECT "confessions".* FROM "confessions" WHERE "confessions"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "confession_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "henhao!"], ["commenter", "pengyou"], ["confession_id", 1], ["created_at", Thu, 11 Oct 2012 16:31:06 UTC +00:00], ["updated_at", Thu, 11 Oct 2012 16:31:06 UTC +00:00]]
---
  def create
    @confession = Confession.find(params[:confession_id])
    @comment = @confession.comments.create(params[:comment])

SELECT "confessions".* FROM "confessions" WHERE "confessions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."confession_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @confession = Confession.find(params[:confession_id])
    @comment = @confession.comments.find(params[:id])
    @comment.destroy